#pragma once 
#include <string>

const std::string general_overview = u8R"(
# CH347 多功能接口演示软件概述
## 芯片简介
CH347 是一款高速USB总线转接芯片，通过USB总线提供  *JTAG接口* 、 *SWD接口* 、 *SPI同步串行接口* 、 *I2C同步串行接口* 和 *异步串口* 等多种功能。
该芯片包含CH347F和CH347T两种型号，主要区别在于封装形式和工作模式配置方式。
___
  * 详细信息可参考：[https://www.wch.cn/products/CH347.html](https://www.wch.cn/products/CH347.html)
  * 芯片使用说明：[https://www.wch.cn/downloads/CH347EVT_ZIP.html](https://www.wch.cn/downloads/CH347EVT_ZIP.html)
芯片驱动：
  * JTAG/SWD/SPI/I2C部分：[https://www.wch.cn/downloads/CH341PAR_EXE.html](https://www.wch.cn/downloads/CH341PAR_EXE.html)
  * UART部分：[https://www.wch.cn/downloads/CH343SER_EXE.html](https://www.wch.cn/downloads/CH343SER_EXE.html)

## 软件功能概述
### I2C功能演示
默认硬件连接 *SHTx系列* 温湿度传感器，用于实时的环境温湿度数据采集。

### JTAG/SWD功能演示
搭配开源项目[xvcd-ch347](https://github.com/AIOT-CAT/xvcd-ch347)，完成Xilinx FPGA的下载调试。
搭配开源项目[OpenOCD](https://github.com/openocd-org/openocd)，完成对指定型号MCU的下载。
  * 注意事项： *FPGA下载调试* 和 *MCU下载* 两个功能无法同时使用。

### SPI功能演示
默认硬件连接 *ST7789系列*，用于选定照片的轮询播放演示。
)";

const std::string i2c_overview = u8R"(
# 温湿度采集功能介绍
此部分为CH347的I2C接口功能演示。
程序将实时显示硬件所连接的SHTx系列温湿度传感器数据，用于环境温度的实时监测。
用户可随时设置采集状态及间隔。

## 硬件接线图如下
+-----------------------------------+          +-------------------------+
|           CH347 模块              |          |     SHT2x/SHT3x 传感器  |
|                                   |          |                         |
|    +-------------------------+    |          |   +-----------------+   |
|    |     引脚标注 (Pinout)   |    |          |   |   引脚定义      |   |
|    |                         |    |          |   |                 |   |
|    | 1: V3.3  ---> 3.3V 输出 |----|----------|-->| VDD  (3.3V)     |   |
|    |                         |    |          |   |                 |   |
|    | 2: GND   ---> 电源地    |----|----------|-->| GND             |   |
|    |                         |    |          |   |                 |   |
|    | 3: SDA   ---> I2C 数据线|----|----------|-->| SDA             |   |
|    |                         |    |          |   |                 |   |
|    | 4: SCL   ---> I2C 时钟线|----|----------|-->| SCL             |   |
|    +-------------------------+    |          |   +-----------------+   |
|                                   |          |                         |
+-----------------------------------+          +-------------------------+
)";

const std::string jtag_overview = u8R"(
# FPGA下载调试功能介绍
此部分为CH347的JTAG接口功能演示，用于FPGA下载调试，需配合Vivado使用。

详细用法可参考：[CH347多功能接口演示软件使用手册中JTAG Xilinx FPGA下载功能介绍部分](./doc/help.pdf)

## 硬件接线图如下
+-----------------------------------+          +-------------------------+
|           CH347 模块              |          |       FPGA JTAG接口     |
|                                   |          |                         |
|    +-------------------------+    |          |   +-----------------+   |
|    |     引脚标注 (Pinout)   |    |          |   |   引脚定义      |   |
|    |                         |    |          |   |                 |   |
|    | 1: V3.3  --- 3.3V 输出  |----|----------|-->| VCC   (3.3V)    |   |
|    |                         |    |          |   |                 |   |
|    | 2: GND   --- 电源地     |----|----------|-->| GND             |   |
|    |                         |    |          |   |                 |   |
|    | 3: TDI   --- 测试数据输入 |--|----------|-->| TDI             |   |
|    |                         |    |          |   |                 |   |
|    | 4: TDO   --- 测试数据输出 |--|----------|-->| TDO             |   |
|    |                         |    |          |   |                 |   |
|    | 5: TCK   --- 测试时钟   |----|----------|-->| TCK             |   |
|    |                         |    |          |   |                 |   |
|    | 6: TMS   --- 测试模式选择 |--|----------|-->| TMS             |   |
|    +-------------------------+    |          |   +-----------------+   |
|                                   |          |                         |
+-----------------------------------+          +-------------------------+
)";

const std::string swd_overview = u8R"(
# MCU下载功能介绍
此部分为CH347的SWD/JTAG接口功能演示，用于MCU程序下载，支持HEX与BIN格式，选择BIN文件时，需填写烧录起始地址。

## 使用方式
选择设备序号、调试接口及速率等基本信息，并确认目标设备文件与当前MCU型号匹配，添加下载文件后进行MCU程序下载。
注意：如下载BI文件，还需确认FLASH起始地址（默认为0x08000000）.

## 硬件接线图如下
+-----------------------------------+          +-------------------------+
|           CH347 模块              |          |         MCU SWD接口     |
|                                   |          |                         |
|    +-------------------------+    |          |   +-----------------+   |
|    |     引脚标注 (Pinout)   |    |          |   |   引脚定义      |   |
|    |                         |    |          |   |                 |   |
|    | 1: V3.3  --- 3.3V 输出  |----|----------|-->| VCC   (3.3V)    |   |
|    |                         |    |          |   |                 |   |
|    | 2: GND   --- 电源地     |----|----------|-->| GND             |   |
|    |                         |    |          |   |                 |   |
|    | 3: SWCLK --- 串行时钟   |----|----------|-->| SWCLK           |   |
|    |                         |    |          |   |                 |   |
|    | 4: SWDIO --- 串行数据   |----|----------|-->| SWDIO           |   |
|    +-------------------------+    |          |   +-----------------+   |
|                                   |          |                         |
+-----------------------------------+          +-------------------------+
)";

const std::string spi_overview = u8R"(
# LCD屏幕控制功能介绍
此部分为CH347的SPI接口功能演示，用于LCD屏幕对自定义图像的轮询展示。
程序对选中的图像进行轮询显示，并保持软件显示图像与SPI同步。
## 前期准备
确认LCD屏幕硬件的DC(Data/Command)与RST(REST)所使用的CH347 GPIO引脚与软件设置中GPIO引脚一致。
## 使用方法
首先点击右下角'添加图片'按钮或直接拖拽图片至软件界面，添加希望SPI轮询展示的图片（如TFT_Picture文件中示例图片），
程序将按照设置的播放间隔刷新LCD屏幕。

如需预览或删除已添加的图片，可右键点击已经添加的图片条目。

## 硬件接线图如下
+-----------------------------------+          +-------------------------+
|           CH347 模块              |          |        ST7789 LCD       |
|                                   |          |                         |
|    +-------------------------+    |          |   +-----------------+   |
|    |     引脚标注 (Pinout)   |    |          |   |   引脚定义      |   |
|    |                         |    |          |   |                 |   |
|    | 1: VCC    --- 3.3V 输出 |----|----------|-->| VCC             |   |
|    |                         |    |          |   |                 |   |
|    | 2: GND    --- 电源地    |----|----------|-->| GND             |   |
|    |                         |    |          |   |                 |   |
|    | 3: MOSI   --- 主出从入  |----|----------|-->| SDA (或DIN)     |   |
|    |                         |    |          |   |                 |   |
|    | 4: SCK    --- 串行时钟  |----|----------|-->| SCL (或SCK)     |   |
|    |                         |    |          |   |                 |   |
|    | 5: SCS0   --- 片选信号  |----|----------|-->| CS              |   |
|    |                         |    |          |   |                 |   |
|    | 6: GPIO0  --- 数据/命令 |----|----------|-->| DC (或D/C)      |   |
|    |                         |    |          |   |                 |   |
|    | 7: GPIO1  --- 复位信号  |----|----------|-->| RST (或RES)     |   |
|    +-------------------------+    |          |   +-----------------+   |
|                                   |          |                         |
+-----------------------------------+          +-------------------------+
)";

const std::string end_overview = u8R"(
# 相关信息
  * 软件版本：V0.1.1
  * [sourceforge](https://sourceforge.net/projects/ch347-multi-function-software/)
  * [使用说明](./doc/help.pdf)
# 使用的开源项目
  * [Dear ImGui v1.92.4](https://github.com/ocornut/imgui)
  * [imgui_markdown](https://github.com/enkisoftware/imgui_markdown)
  * [OpenOCD v0.12.0](https://github.com/openocd-org/openocd)
  * [xvcd-ch347 v1.0.0](https://github.com/AIOT-CAT/xvcd-ch347)
)";